# Telcel TCP Mock Server

Este proyecto simula un servidor TCP que responde a los mensajes del protocolo Telcel (`Pago de Factura`, `Tiempo Aire`, `Echo`, etc.), y responde con mensajes formateados como Telcel.

===================================
ðŸ–¥ CÃ³mo probarlo desde consola
===================================

1. ConÃ©ctate al servidor usando netcat:

  nc <host> 9000

  Reemplaza <host> con tu dominio pÃºblico de Railway o "localhost" si lo corres local.

===================================
ðŸ“¡ Casos de uso disponibles
===================================

â–¶ 1. Echo Test

Mensaje a enviar:
\x0298DU00000120250627170000\x03

Resultado esperado:
  El servidor responde con \x0299DU... (Echo response simulado).

-----------------------------------

â–¶ 2. Pago de Factura (13DU)

Mensaje de prueba:
\x0213DU00000120250627170000...<relleno hasta byte 83>...5551234590\x03

  Nota: el nÃºmero en bytes 73-83 debe terminar con dos dÃ­gitos (por ejemplo: 90) que serÃ¡n usados como cÃ³digo de respuesta.

Resultado esperado:
  Respuesta comienza con \x0214DU... e incluye:
  - CÃ³digo de respuesta = Ãºltimos 2 dÃ­gitos del nÃºmero
  - Monto simulado
  - TelÃ©fono y CUR fijos

-----------------------------------

â–¶ 3. Tiempo Aire (01DU)

Mensaje de prueba:
\x0201DU00000120250627170000TX1234567890\x03

Resultado esperado:
  Respuesta con \x0202DU... (acciÃ³n 02) con cÃ³digo de respuesta 00.

-----------------------------------

â–¶ 4. Venta de Servicio (21DU)

Mensaje de prueba:
\x0221DU00000120250627170000SRV1234567890\x03

Resultado esperado:
  Respuesta con \x0222DU... incluyendo ID producto, monto simulado y respuesta 00.

===================================
ðŸ›  CÃ³mo generar los mensajes desde Bash
===================================

# Echo
echo -ne "\x0298DU000001$(date +%Y%m%d%H%M%S)\x03" | nc <host> 9000

# Pago de factura (telÃ©fono termina en 90)
echo -ne "\x0213DU000001$(date +%Y%m%d%H%M%S)$(printf 'X%.0s' {1..60})5551234590\x03" | nc <host> 9000

# Tiempo aire
echo -ne "\x0201DU000001$(date +%Y%m%d%H%M%S)TX1234567890\x03" | nc <host> 9000

# Venta servicio
echo -ne "\x0221DU000001$(date +%Y%m%d%H%M%S)SRV1234567890\x03" | nc <host> 9000

===================================
ðŸ“œ Script automatizado: test_telcel_mock.sh
===================================

Guarda el siguiente contenido en un archivo llamado `test_telcel_mock.sh`:

-----------------------------------------------------
#!/bin/bash

HOST="${1:-localhost}"
PORT="${2:-9000}"

timestamp=$(date +%Y%m%d%H%M%S)

function send_message() {
  local name="$1"
  local raw="$2"

  echo -ne "$raw" | nc "$HOST" "$PORT" | tee "response_${name}.txt"
  echo -e "\nâœ… Saved to response_${name}.txt"
}

echo "ðŸ”„ Testing Echo (98DU)..."
send_message "echo" "\x0298DU000001${timestamp}\x03"

echo -e "\nðŸ”„ Testing Pago de Factura (13DU)..."
RELLENO=$(printf 'X%.0s' {1..60})
send_message "pago" "\x0213DU000001${timestamp}${RELLENO}5551234590\x03"

echo -e "\nðŸ”„ Testing Tiempo Aire (01DU)..."
send_message "tiempoaire" "\x0201DU000001${timestamp}TX1234567890\x03"

echo -e "\nðŸ”„ Testing Venta de Servicio (21DU)..."
send_message "servicio" "\x0221DU000001${timestamp}SRV1234567890\x03"

echo -e "\nâœ… Pruebas completadas contra $HOST:$PORT"
-----------------------------------------------------

Luego, hazlo ejecutable:

chmod +x test_telcel_mock.sh

Y ejecÃºtalo asÃ­:

./test_telcel_mock.sh localhost 9000
# o
./test_telcel_mock.sh mi-servidor.railway.app 9000

Esto generarÃ¡:
- response_echo.txt
- response_pago.txt
- response_tiempoaire.txt
- response_servicio.txt